AmbiqAI/nnse/evb/includes/extern/AmbiqSuite/R5.2.0/mcu/apollo5b/regs/am_mcu_apollo5b_otpinfo1.h
// SBLOTA - This is the address of the slot to be used by the Secure Boot Loader for staging an upgrade.
#define AM_REG_OTP_INFO1_SBLOTA_ADDRESS_S 0
#define AM_REG_OTP_INFO1_SBLOTA_ADDRESS_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_SBLOTA_ADDRESS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_SBLOTA_ADDRESS_Pos 0
#define AM_REG_OTP_INFO1_SBLOTA_ADDRESS_Msk 0xFFFFFFFF

// SOCID0 - SoC_ID is a statistically unique identification for the device required for the creation of debug certificates.
#define AM_REG_OTP_INFO1_SOCID0_ID_S 0
#define AM_REG_OTP_INFO1_SOCID0_ID_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_SOCID0_ID(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_SOCID0_ID_Pos 0
#define AM_REG_OTP_INFO1_SOCID0_ID_Msk 0xFFFFFFFF

// SOCID1 - SoC_ID is a statistically unique identification for the device required for the creation of debug certificates.
#define AM_REG_OTP_INFO1_SOCID1_ID_S 0
#define AM_REG_OTP_INFO1_SOCID1_ID_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_SOCID1_ID(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_SOCID1_ID_Pos 0
#define AM_REG_OTP_INFO1_SOCID1_ID_Msk 0xFFFFFFFF

// SOCID2 - SoC_ID is a statistically unique identification for the device required for the creation of debug certificates.
#define AM_REG_OTP_INFO1_SOCID2_ID_S 0
#define AM_REG_OTP_INFO1_SOCID2_ID_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_SOCID2_ID(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_SOCID2_ID_Pos 0
#define AM_REG_OTP_INFO1_SOCID2_ID_Msk 0xFFFFFFFF

// SOCID3 - SoC_ID is a statistically unique identification for the device required for the creation of debug certificates.
#define AM_REG_OTP_INFO1_SOCID3_ID_S 0
#define AM_REG_OTP_INFO1_SOCID3_ID_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_SOCID3_ID(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_SOCID3_ID_Pos 0
#define AM_REG_OTP_INFO1_SOCID3_ID_Msk 0xFFFFFFFF

// SOCID4 - SoC_ID is a statistically unique identification for the device required for the creation of debug certificates.
#define AM_REG_OTP_INFO1_SOCID4_ID_S 0
#define AM_REG_OTP_INFO1_SOCID4_ID_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_SOCID4_ID(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_SOCID4_ID_Pos 0
#define AM_REG_OTP_INFO1_SOCID4_ID_Msk 0xFFFFFFFF

// SOCID5 - SoC_ID is a statistically unique identification for the device required for the creation of debug certificates.
#define AM_REG_OTP_INFO1_SOCID5_ID_S 0
#define AM_REG_OTP_INFO1_SOCID5_ID_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_SOCID5_ID(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_SOCID5_ID_Pos 0
#define AM_REG_OTP_INFO1_SOCID5_ID_Msk 0xFFFFFFFF

// SOCID6 - SoC_ID is a statistically unique identification for the device required for the creation of debug certificates.
#define AM_REG_OTP_INFO1_SOCID6_ID_S 0
#define AM_REG_OTP_INFO1_SOCID6_ID_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_SOCID6_ID(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_SOCID6_ID_Pos 0
#define AM_REG_OTP_INFO1_SOCID6_ID_Msk 0xFFFFFFFF

// SOCID7 - SoC_ID is a statistically unique identification for the device required for the creation of debug certificates.
#define AM_REG_OTP_INFO1_SOCID7_ID_S 0
#define AM_REG_OTP_INFO1_SOCID7_ID_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_SOCID7_ID(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_SOCID7_ID_Pos 0
#define AM_REG_OTP_INFO1_SOCID7_ID_Msk 0xFFFFFFFF

// PATCH_TRACKER0 - Apollo510 family SBL patch tracking [31:0]
#define AM_REG_OTP_INFO1_PATCH_TRACKER0_RSVD0_S 0
#define AM_REG_OTP_INFO1_PATCH_TRACKER0_RSVD0_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_PATCH_TRACKER0_RSVD0(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_PATCH_TRACKER0_RSVD0_Pos 0
#define AM_REG_OTP_INFO1_PATCH_TRACKER0_RSVD0_Msk 0xFFFFFFFF

// PATCH_TRACKER1 - Apollo510 family SBL patch tracking [63:32]
#define AM_REG_OTP_INFO1_PATCH_TRACKER1_RSVD1_S 0
#define AM_REG_OTP_INFO1_PATCH_TRACKER1_RSVD1_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_PATCH_TRACKER1_RSVD1(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_PATCH_TRACKER1_RSVD1_Pos 0
#define AM_REG_OTP_INFO1_PATCH_TRACKER1_RSVD1_Msk 0xFFFFFFFF

// PATCH_TRACKER2 - Apollo510 family SBL patch tracking [95:64]
#define AM_REG_OTP_INFO1_PATCH_TRACKER2_RSVD2_S 0
#define AM_REG_OTP_INFO1_PATCH_TRACKER2_RSVD2_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_PATCH_TRACKER2_RSVD2(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_PATCH_TRACKER2_RSVD2_Pos 0
#define AM_REG_OTP_INFO1_PATCH_TRACKER2_RSVD2_Msk 0xFFFFFFFF

// PATCH_TRACKER3 - Apollo510 family SBL patch tracking [127:96]
#define AM_REG_OTP_INFO1_PATCH_TRACKER3_RSVD3_S 0
#define AM_REG_OTP_INFO1_PATCH_TRACKER3_RSVD3_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_PATCH_TRACKER3_RSVD3(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_PATCH_TRACKER3_RSVD3_Pos 0
#define AM_REG_OTP_INFO1_PATCH_TRACKER3_RSVD3_Msk 0xFFFFFFFF

// SBR_SDCERT_ADDR - A pointer to the SD certificate.
#define AM_REG_OTP_INFO1_SBR_SDCERT_ADDR_ICV_S 0
#define AM_REG_OTP_INFO1_SBR_SDCERT_ADDR_ICV_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_SBR_SDCERT_ADDR_ICV(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_SBR_SDCERT_ADDR_ICV_Pos 0
#define AM_REG_OTP_INFO1_SBR_SDCERT_ADDR_ICV_Msk 0xFFFFFFFF

// SBR_IPT_ADDR - A pointer to the SBR IPT.
#define AM_REG_OTP_INFO1_SBR_IPT_ADDR_ADDRESS_S 0
#define AM_REG_OTP_INFO1_SBR_IPT_ADDR_ADDRESS_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_SBR_IPT_ADDR_ADDRESS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_SBR_IPT_ADDR_ADDRESS_Pos 0
#define AM_REG_OTP_INFO1_SBR_IPT_ADDR_ADDRESS_Msk 0xFFFFFFFF

// SBR_OPT_ADDR - A pointer to the SBR OPT.
#define AM_REG_OTP_INFO1_SBR_OPT_ADDR_ADDRESS_S 0
#define AM_REG_OTP_INFO1_SBR_OPT_ADDR_ADDRESS_M 0xFFFFFFFF
#define AM_REG_OTP_INFO1_SBR_OPT_ADDR_ADDRESS(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO1_SBR_OPT_ADDR_ADDRESS_Pos 0
#define AM_REG_OTP_INFO1_SBR_OPT_ADDR_ADDRESS_Msk 0xFFFFFFFF

// TRIM_SBR_OTP - This register configures the SBR for how it will handle OTP errors during the boot process.
#define AM_REG_OTP_INFO1_TRIM_SBR_OTP_RESVD20_S 20
#define AM_REG_OTP_INFO1_TRIM_SBR_OTP_RESVD20_M 0xFFF00000
#define AM_REG_OTP_INFO1_TRIM_SBR_OTP_RESVD20(n) (((uint32_t)(n) << 20) & 0xFFF00000)
#define AM_REG_OTP_INFO1_TRIM_SBR_OTP_RESVD20_Pos 20
#define AM_REG_OTP_INFO1_TRIM_SBR_OTP_RESVD20_Msk 0xFFF00000
#define AM_REG_OTP_INFO1_TRIM_SBR_OTP_MAX_OTP_RETRY_S 12
#define AM_REG_OTP_INFO1_TRIM_SBR_OTP_MAX_OTP_RETRY_M 0x000FF000
#define AM_REG_OTP_INFO1_TRIM_SBR_OTP_MAX_OTP_RETRY(n) (((uint32_t)(n) << 12) & 0x000FF000)
#define AM_REG_OTP_INFO1_TRIM_SBR_OTP_MAX_OTP_RETRY_Pos 12
#define AM_REG_OTP_INFO1_TRIM_SBR_OTP_MAX_OTP_RETRY_Msk 0x000FF000
#define AM_REG_OTP_INFO1_TRIM_SBR_OTP_RESVD10_S 10
#define AM_REG_OTP_INFO1_TRIM_SBR_OTP_RESVD10_M 0x00000C00
#define AM_REG_OTP_INFO1_TRIM_SBR_OTP_RESVD10(n) (((uint32_t)(n) << 10) & 0x00000C00)
#define AM_REG_OTP_INFO1_TRIM_SBR_OTP_RESVD10_Pos 10
#define AM_REG_OTP_INFO1_TRIM_SBR_OTP_RESVD10_Msk 0x00000C00
#define AM_REG_OTP_INFO1_TRIM_SBR_OTP_INT_MASK_S 0
#define AM_REG_OTP_INFO1_TRIM_SBR_OTP_INT_MASK_M 0x000003FF
#define AM_REG_OTP_INFO1_TRIM_SBR_OTP_INT_MASK(n) (((uint32_t)(n) << 0) & 0x000003FF)
#define AM_REG_OTP_INFO1_TRIM_SBR_OTP_INT_MASK_Pos 0
#define AM_REG_OTP_INFO1_TRIM_SBR_OTP_INT_MASK_Msk 0x000003FF

