AmbiqAI/nnse/evb/includes/extern/AmbiqSuite/R5.2.0/mcu/apollo5b/regs/am_mcu_apollo5b_otpinfo1.h
// POWERSTATE4 - Power state register. CPU LP mode, GPU on and/or XYZ peripherals on. Temperature range greater than 50C.
#define AM_REG_OTP_INFO1_POWERSTATE4_RESVD29_S 29
#define AM_REG_OTP_INFO1_POWERSTATE4_RESVD29_M 0xE0000000
#define AM_REG_OTP_INFO1_POWERSTATE4_RESVD29(n) (((uint32_t)(n) << 29) & 0xE0000000)
#define AM_REG_OTP_INFO1_POWERSTATE4_RESVD29_Pos 29
#define AM_REG_OTP_INFO1_POWERSTATE4_RESVD29_Msk 0xE0000000
#define AM_REG_OTP_INFO1_POWERSTATE4_TVRGCVREFSEL_S 28
#define AM_REG_OTP_INFO1_POWERSTATE4_TVRGCVREFSEL_M 0x10000000
#define AM_REG_OTP_INFO1_POWERSTATE4_TVRGCVREFSEL(n) (((uint32_t)(n) << 28) & 0x10000000)
#define AM_REG_OTP_INFO1_POWERSTATE4_TVRGCVREFSEL_Pos 28
#define AM_REG_OTP_INFO1_POWERSTATE4_TVRGCVREFSEL_Msk 0x10000000
#define AM_REG_OTP_INFO1_POWERSTATE4_TVRGCACTTRIM_S 21
#define AM_REG_OTP_INFO1_POWERSTATE4_TVRGCACTTRIM_M 0x0FE00000
#define AM_REG_OTP_INFO1_POWERSTATE4_TVRGCACTTRIM(n) (((uint32_t)(n) << 21) & 0x0FE00000)
#define AM_REG_OTP_INFO1_POWERSTATE4_TVRGCACTTRIM_Pos 21
#define AM_REG_OTP_INFO1_POWERSTATE4_TVRGCACTTRIM_Msk 0x0FE00000
#define AM_REG_OTP_INFO1_POWERSTATE4_CORELDOTEMPCOTRIM_S 17
#define AM_REG_OTP_INFO1_POWERSTATE4_CORELDOTEMPCOTRIM_M 0x001E0000
#define AM_REG_OTP_INFO1_POWERSTATE4_CORELDOTEMPCOTRIM(n) (((uint32_t)(n) << 17) & 0x001E0000)
#define AM_REG_OTP_INFO1_POWERSTATE4_CORELDOTEMPCOTRIM_Pos 17
#define AM_REG_OTP_INFO1_POWERSTATE4_CORELDOTEMPCOTRIM_Msk 0x001E0000
#define AM_REG_OTP_INFO1_POWERSTATE4_CORELDOACTTRIM_S 7
#define AM_REG_OTP_INFO1_POWERSTATE4_CORELDOACTTRIM_M 0x0001FF80
#define AM_REG_OTP_INFO1_POWERSTATE4_CORELDOACTTRIM(n) (((uint32_t)(n) << 7) & 0x0001FF80)
#define AM_REG_OTP_INFO1_POWERSTATE4_CORELDOACTTRIM_Pos 7
#define AM_REG_OTP_INFO1_POWERSTATE4_CORELDOACTTRIM_Msk 0x0001FF80
#define AM_REG_OTP_INFO1_POWERSTATE4_TVRGFACTTRIM_S 0
#define AM_REG_OTP_INFO1_POWERSTATE4_TVRGFACTTRIM_M 0x0000007F
#define AM_REG_OTP_INFO1_POWERSTATE4_TVRGFACTTRIM(n) (((uint32_t)(n) << 0) & 0x0000007F)
#define AM_REG_OTP_INFO1_POWERSTATE4_TVRGFACTTRIM_Pos 0
#define AM_REG_OTP_INFO1_POWERSTATE4_TVRGFACTTRIM_Msk 0x0000007F

// POWERSTATE5 - Power state register. CPU LP mode, GPU on and/or XYZ peripherals on. Temperature range 0C to 50C.
#define AM_REG_OTP_INFO1_POWERSTATE5_RESVD29_S 29
#define AM_REG_OTP_INFO1_POWERSTATE5_RESVD29_M 0xE0000000
#define AM_REG_OTP_INFO1_POWERSTATE5_RESVD29(n) (((uint32_t)(n) << 29) & 0xE0000000)
#define AM_REG_OTP_INFO1_POWERSTATE5_RESVD29_Pos 29
#define AM_REG_OTP_INFO1_POWERSTATE5_RESVD29_Msk 0xE0000000
#define AM_REG_OTP_INFO1_POWERSTATE5_TVRGCVREFSEL_S 28
#define AM_REG_OTP_INFO1_POWERSTATE5_TVRGCVREFSEL_M 0x10000000
#define AM_REG_OTP_INFO1_POWERSTATE5_TVRGCVREFSEL(n) (((uint32_t)(n) << 28) & 0x10000000)
#define AM_REG_OTP_INFO1_POWERSTATE5_TVRGCVREFSEL_Pos 28
#define AM_REG_OTP_INFO1_POWERSTATE5_TVRGCVREFSEL_Msk 0x10000000
#define AM_REG_OTP_INFO1_POWERSTATE5_TVRGCACTTRIM_S 21
#define AM_REG_OTP_INFO1_POWERSTATE5_TVRGCACTTRIM_M 0x0FE00000
#define AM_REG_OTP_INFO1_POWERSTATE5_TVRGCACTTRIM(n) (((uint32_t)(n) << 21) & 0x0FE00000)
#define AM_REG_OTP_INFO1_POWERSTATE5_TVRGCACTTRIM_Pos 21
#define AM_REG_OTP_INFO1_POWERSTATE5_TVRGCACTTRIM_Msk 0x0FE00000
#define AM_REG_OTP_INFO1_POWERSTATE5_CORELDOTEMPCOTRIM_S 17
#define AM_REG_OTP_INFO1_POWERSTATE5_CORELDOTEMPCOTRIM_M 0x001E0000
#define AM_REG_OTP_INFO1_POWERSTATE5_CORELDOTEMPCOTRIM(n) (((uint32_t)(n) << 17) & 0x001E0000)
#define AM_REG_OTP_INFO1_POWERSTATE5_CORELDOTEMPCOTRIM_Pos 17
#define AM_REG_OTP_INFO1_POWERSTATE5_CORELDOTEMPCOTRIM_Msk 0x001E0000
#define AM_REG_OTP_INFO1_POWERSTATE5_CORELDOACTTRIM_S 7
#define AM_REG_OTP_INFO1_POWERSTATE5_CORELDOACTTRIM_M 0x0001FF80
#define AM_REG_OTP_INFO1_POWERSTATE5_CORELDOACTTRIM(n) (((uint32_t)(n) << 7) & 0x0001FF80)
#define AM_REG_OTP_INFO1_POWERSTATE5_CORELDOACTTRIM_Pos 7
#define AM_REG_OTP_INFO1_POWERSTATE5_CORELDOACTTRIM_Msk 0x0001FF80
#define AM_REG_OTP_INFO1_POWERSTATE5_TVRGFACTTRIM_S 0
#define AM_REG_OTP_INFO1_POWERSTATE5_TVRGFACTTRIM_M 0x0000007F
#define AM_REG_OTP_INFO1_POWERSTATE5_TVRGFACTTRIM(n) (((uint32_t)(n) << 0) & 0x0000007F)
#define AM_REG_OTP_INFO1_POWERSTATE5_TVRGFACTTRIM_Pos 0
#define AM_REG_OTP_INFO1_POWERSTATE5_TVRGFACTTRIM_Msk 0x0000007F

// POWERSTATE6 - Power state register. CPU LP mode, GPU on and/or XYZ peripherals on Temperature range -20C to 0C.
#define AM_REG_OTP_INFO1_POWERSTATE6_RESVD29_S 29
#define AM_REG_OTP_INFO1_POWERSTATE6_RESVD29_M 0xE0000000
#define AM_REG_OTP_INFO1_POWERSTATE6_RESVD29(n) (((uint32_t)(n) << 29) & 0xE0000000)
#define AM_REG_OTP_INFO1_POWERSTATE6_RESVD29_Pos 29
#define AM_REG_OTP_INFO1_POWERSTATE6_RESVD29_Msk 0xE0000000
#define AM_REG_OTP_INFO1_POWERSTATE6_TVRGCVREFSEL_S 28
#define AM_REG_OTP_INFO1_POWERSTATE6_TVRGCVREFSEL_M 0x10000000
#define AM_REG_OTP_INFO1_POWERSTATE6_TVRGCVREFSEL(n) (((uint32_t)(n) << 28) & 0x10000000)
#define AM_REG_OTP_INFO1_POWERSTATE6_TVRGCVREFSEL_Pos 28
#define AM_REG_OTP_INFO1_POWERSTATE6_TVRGCVREFSEL_Msk 0x10000000
#define AM_REG_OTP_INFO1_POWERSTATE6_TVRGCACTTRIM_S 21
#define AM_REG_OTP_INFO1_POWERSTATE6_TVRGCACTTRIM_M 0x0FE00000
#define AM_REG_OTP_INFO1_POWERSTATE6_TVRGCACTTRIM(n) (((uint32_t)(n) << 21) & 0x0FE00000)
#define AM_REG_OTP_INFO1_POWERSTATE6_TVRGCACTTRIM_Pos 21
#define AM_REG_OTP_INFO1_POWERSTATE6_TVRGCACTTRIM_Msk 0x0FE00000
#define AM_REG_OTP_INFO1_POWERSTATE6_CORELDOTEMPCOTRIM_S 17
#define AM_REG_OTP_INFO1_POWERSTATE6_CORELDOTEMPCOTRIM_M 0x001E0000
#define AM_REG_OTP_INFO1_POWERSTATE6_CORELDOTEMPCOTRIM(n) (((uint32_t)(n) << 17) & 0x001E0000)
#define AM_REG_OTP_INFO1_POWERSTATE6_CORELDOTEMPCOTRIM_Pos 17
#define AM_REG_OTP_INFO1_POWERSTATE6_CORELDOTEMPCOTRIM_Msk 0x001E0000
#define AM_REG_OTP_INFO1_POWERSTATE6_CORELDOACTTRIM_S 7
#define AM_REG_OTP_INFO1_POWERSTATE6_CORELDOACTTRIM_M 0x0001FF80
#define AM_REG_OTP_INFO1_POWERSTATE6_CORELDOACTTRIM(n) (((uint32_t)(n) << 7) & 0x0001FF80)
#define AM_REG_OTP_INFO1_POWERSTATE6_CORELDOACTTRIM_Pos 7
#define AM_REG_OTP_INFO1_POWERSTATE6_CORELDOACTTRIM_Msk 0x0001FF80
#define AM_REG_OTP_INFO1_POWERSTATE6_TVRGFACTTRIM_S 0
#define AM_REG_OTP_INFO1_POWERSTATE6_TVRGFACTTRIM_M 0x0000007F
#define AM_REG_OTP_INFO1_POWERSTATE6_TVRGFACTTRIM(n) (((uint32_t)(n) << 0) & 0x0000007F)
#define AM_REG_OTP_INFO1_POWERSTATE6_TVRGFACTTRIM_Pos 0
#define AM_REG_OTP_INFO1_POWERSTATE6_TVRGFACTTRIM_Msk 0x0000007F

// POWERSTATE7 - Power state register. CPU LP mode, GPU on and/or XYZ peripherals on. Temperature range -40C to -20C.
#define AM_REG_OTP_INFO1_POWERSTATE7_RESVD29_S 29
#define AM_REG_OTP_INFO1_POWERSTATE7_RESVD29_M 0xE0000000
#define AM_REG_OTP_INFO1_POWERSTATE7_RESVD29(n) (((uint32_t)(n) << 29) & 0xE0000000)
#define AM_REG_OTP_INFO1_POWERSTATE7_RESVD29_Pos 29
#define AM_REG_OTP_INFO1_POWERSTATE7_RESVD29_Msk 0xE0000000
#define AM_REG_OTP_INFO1_POWERSTATE7_TVRGCVREFSEL_S 28
#define AM_REG_OTP_INFO1_POWERSTATE7_TVRGCVREFSEL_M 0x10000000
#define AM_REG_OTP_INFO1_POWERSTATE7_TVRGCVREFSEL(n) (((uint32_t)(n) << 28) & 0x10000000)
#define AM_REG_OTP_INFO1_POWERSTATE7_TVRGCVREFSEL_Pos 28
#define AM_REG_OTP_INFO1_POWERSTATE7_TVRGCVREFSEL_Msk 0x10000000
#define AM_REG_OTP_INFO1_POWERSTATE7_TVRGCACTTRIM_S 21
#define AM_REG_OTP_INFO1_POWERSTATE7_TVRGCACTTRIM_M 0x0FE00000
#define AM_REG_OTP_INFO1_POWERSTATE7_TVRGCACTTRIM(n) (((uint32_t)(n) << 21) & 0x0FE00000)
#define AM_REG_OTP_INFO1_POWERSTATE7_TVRGCACTTRIM_Pos 21
#define AM_REG_OTP_INFO1_POWERSTATE7_TVRGCACTTRIM_Msk 0x0FE00000
#define AM_REG_OTP_INFO1_POWERSTATE7_CORELDOTEMPCOTRIM_S 17
#define AM_REG_OTP_INFO1_POWERSTATE7_CORELDOTEMPCOTRIM_M 0x001E0000
#define AM_REG_OTP_INFO1_POWERSTATE7_CORELDOTEMPCOTRIM(n) (((uint32_t)(n) << 17) & 0x001E0000)
#define AM_REG_OTP_INFO1_POWERSTATE7_CORELDOTEMPCOTRIM_Pos 17
#define AM_REG_OTP_INFO1_POWERSTATE7_CORELDOTEMPCOTRIM_Msk 0x001E0000
#define AM_REG_OTP_INFO1_POWERSTATE7_CORELDOACTTRIM_S 7
#define AM_REG_OTP_INFO1_POWERSTATE7_CORELDOACTTRIM_M 0x0001FF80
#define AM_REG_OTP_INFO1_POWERSTATE7_CORELDOACTTRIM(n) (((uint32_t)(n) << 7) & 0x0001FF80)
#define AM_REG_OTP_INFO1_POWERSTATE7_CORELDOACTTRIM_Pos 7
#define AM_REG_OTP_INFO1_POWERSTATE7_CORELDOACTTRIM_Msk 0x0001FF80
#define AM_REG_OTP_INFO1_POWERSTATE7_TVRGFACTTRIM_S 0
#define AM_REG_OTP_INFO1_POWERSTATE7_TVRGFACTTRIM_M 0x0000007F
#define AM_REG_OTP_INFO1_POWERSTATE7_TVRGFACTTRIM(n) (((uint32_t)(n) << 0) & 0x0000007F)
#define AM_REG_OTP_INFO1_POWERSTATE7_TVRGFACTTRIM_Pos 0
#define AM_REG_OTP_INFO1_POWERSTATE7_TVRGFACTTRIM_Msk 0x0000007F

// POWERSTATE8 - Power state register. CPU HP mode, GPU off, XYZ peripherals off. Temperature range greater than 50C.
#define AM_REG_OTP_INFO1_POWERSTATE8_RESVD29_S 29
#define AM_REG_OTP_INFO1_POWERSTATE8_RESVD29_M 0xE0000000
#define AM_REG_OTP_INFO1_POWERSTATE8_RESVD29(n) (((uint32_t)(n) << 29) & 0xE0000000)
#define AM_REG_OTP_INFO1_POWERSTATE8_RESVD29_Pos 29
#define AM_REG_OTP_INFO1_POWERSTATE8_RESVD29_Msk 0xE0000000
#define AM_REG_OTP_INFO1_POWERSTATE8_TVRGCVREFSEL_S 28
#define AM_REG_OTP_INFO1_POWERSTATE8_TVRGCVREFSEL_M 0x10000000
#define AM_REG_OTP_INFO1_POWERSTATE8_TVRGCVREFSEL(n) (((uint32_t)(n) << 28) & 0x10000000)
#define AM_REG_OTP_INFO1_POWERSTATE8_TVRGCVREFSEL_Pos 28
#define AM_REG_OTP_INFO1_POWERSTATE8_TVRGCVREFSEL_Msk 0x10000000
#define AM_REG_OTP_INFO1_POWERSTATE8_TVRGCACTTRIM_S 21
#define AM_REG_OTP_INFO1_POWERSTATE8_TVRGCACTTRIM_M 0x0FE00000
#define AM_REG_OTP_INFO1_POWERSTATE8_TVRGCACTTRIM(n) (((uint32_t)(n) << 21) & 0x0FE00000)
#define AM_REG_OTP_INFO1_POWERSTATE8_TVRGCACTTRIM_Pos 21
#define AM_REG_OTP_INFO1_POWERSTATE8_TVRGCACTTRIM_Msk 0x0FE00000
#define AM_REG_OTP_INFO1_POWERSTATE8_CORELDOTEMPCOTRIM_S 17
#define AM_REG_OTP_INFO1_POWERSTATE8_CORELDOTEMPCOTRIM_M 0x001E0000
#define AM_REG_OTP_INFO1_POWERSTATE8_CORELDOTEMPCOTRIM(n) (((uint32_t)(n) << 17) & 0x001E0000)
#define AM_REG_OTP_INFO1_POWERSTATE8_CORELDOTEMPCOTRIM_Pos 17
#define AM_REG_OTP_INFO1_POWERSTATE8_CORELDOTEMPCOTRIM_Msk 0x001E0000
#define AM_REG_OTP_INFO1_POWERSTATE8_CORELDOACTTRIM_S 7
#define AM_REG_OTP_INFO1_POWERSTATE8_CORELDOACTTRIM_M 0x0001FF80
#define AM_REG_OTP_INFO1_POWERSTATE8_CORELDOACTTRIM(n) (((uint32_t)(n) << 7) & 0x0001FF80)
#define AM_REG_OTP_INFO1_POWERSTATE8_CORELDOACTTRIM_Pos 7
#define AM_REG_OTP_INFO1_POWERSTATE8_CORELDOACTTRIM_Msk 0x0001FF80
#define AM_REG_OTP_INFO1_POWERSTATE8_TVRGFACTTRIM_S 0
#define AM_REG_OTP_INFO1_POWERSTATE8_TVRGFACTTRIM_M 0x0000007F
#define AM_REG_OTP_INFO1_POWERSTATE8_TVRGFACTTRIM(n) (((uint32_t)(n) << 0) & 0x0000007F)
#define AM_REG_OTP_INFO1_POWERSTATE8_TVRGFACTTRIM_Pos 0
#define AM_REG_OTP_INFO1_POWERSTATE8_TVRGFACTTRIM_Msk 0x0000007F

